tests/fixtures/get-order-by-id.json

{"data": {"unpaid_guarantees": [], "total_currency": "GBP", "total_amount": "90.80", "tax_currency": "GBP", "tax_amount": "30.20", "slices": [{"segments": [{"passengers": [{"seat": {"name": "Exit row seat", "disclosures": ["Do not seat children in exit row seats", "Do not seat passengers with special needs in exit row seats"], "designator": "14B"}, "passenger_id": "passenger_0", "cabin_class_marketing_name": "Economy Basic", "cabin_class": "economy", "baggages": [{"type": "checked", "quantity": 1}]}], "origin_terminal": "B", "origin": {"time_zone": "Europe/London", "name": "Heathrow", "longitude": -141.951519, "latitude": 64.068865, "id": "arp_lhr_gb", "icao_code": "EGLL", "iata_country_code": "GB", "iata_code": "LHR", "city_name": "London", "city": {"name": "London", "id": "cit_lon_gb", "iata_country_code": "GB", "iata_code": "LON"}}, "operating_carrier_flight_number": "4321", "operating_carrier": {"name": "British Airways", "id": "aln_00001876aqC8c5umZmrRds", "iata_code": "BA"}, "marketing_carrier_flight_number": "1234", "marketing_carrier": {"name": "British Airways", "id": "aln_00001876aqC8c5umZmrRds", "iata_code": "BA"}, "id": "seg_00009htYpSCXrwaB9Dn456", "duration": "PT02H26M", "distance": "424.2", "destination_terminal": "5", "destination": {"time_zone": "Europe/London", "name": "Heathrow", "longitude": -141.951519, "latitude": 64.068865, "id": "arp_lhr_gb", "icao_code": "EGLL", "iata_country_code": "GB", "iata_code": "LHR", "city_name": "London", "city": {"name": "London", "id": "cit_lon_gb", "iata_country_code": "GB", "iata_code": "LON"}}, "departure_terminal": "B", "departure_datetime": "2020-06-13T16:38:02", "departing_at": "2020-06-13T16:38:02", "arriving_at": "2020-06-13T16:38:02", "arrival_terminal": "5", "arrival_datetime": "2020-06-13T16:38:02", "aircraft": {"name": "Airbus Industries A380", "id": "arc_00009UhD4ongolulWd91Ky", "iata_code": "380"}}], "origin_type": "airport", "origin": {"type": "airport", "time_zone": "Europe/London", "name": "Heathrow", "longitude": -141.951519, "latitude": 64.068865, "id": "arp_lhr_gb", "icao_code": "EGLL", "iata_country_code": "GB", "iata_code": "LHR", "iata_city_code": "LON", "city_name": "London", "city": {"name": "London", "id": "cit_lon_gb", "iata_country_code": "GB", "iata_code": "LON"}, "airports": [{"time_zone": "Europe/London", "name": "Heathrow", "longitude": -141.951519, "latitude": 64.068865, "id": "arp_lhr_gb", "icao_code": "EGLL", "iata_country_code": "GB", "iata_code": "LHR", "city_name": "London", "city": {"name": "London", "id": "cit_lon_gb", "iata_country_code": "GB", "iata_code": "LON"}}]}, "id": "sli_00009htYpSCXrwaB9Dn123", "duration": "PT02H26M", "destination_type": "airport", "destination": {"type": "airport", "time_zone": "Europe/London", "name": "Heathrow", "longitude": -141.951519, "latitude": 64.068865, "id": "arp_lhr_gb", "icao_code": "EGLL", "iata_country_code": "GB", "iata_code": "LHR", "iata_city_code": "LON", "city_name": "London", "city": {"name": "London", "id": "cit_lon_gb", "iata_country_code": "GB", "iata_code": "LON"}, "airports": [{"time_zone": "Europe/London", "name": "Heathrow", "longitude": -141.951519, "latitude": 64.068865, "id": "arp_lhr_gb", "icao_code": "EGLL", "iata_country_code": "GB", "iata_code": "LHR", "city_name": "London", "city": {"name": "London", "id": "cit_lon_gb", "iata_country_code": "GB", "iata_code": "LON"}}]}, "conditions": {"change_before_departure": {"fee_currency": "GBP", "fee_amount": "100.00", "allowed": true}}}], "services": [{"type": "baggage", "total_currency": "GBP", "total_amount": "15.00", "segment_ids": ["seg_00009hj8USM7Ncg31cB456"], "quantity": 1, "passenger_ids": ["pas_00009hj8USM7Ncg31cBCLL"], "id": "ser_00009UhD4ongolulWd9123"}], "payment_status": {"pay_by": "2020-01-17T10:42:14.545Z", "awaiting_payment": false}, "passengers": [{"type": "adult", "title": "mrs", "infant_passenger_id": "pas_00009hj8USM8Ncg32aTGHL", "id": "pas_00009hj8USM7Ncg31cBCLL", "given_name": "Amelia", "gender": "f", "family_name": "Earhart", "born_on": "1987-07-24"}], "owner": {"name": "British Airways", "id": "aln_00001876aqC8c5umZmrRds", "iata_code": "BA"}, "live_mode": false, "id": "ord_00009hthhsUZ8W4LxQgkjo", "documents": [{"unique_identifier": "1252106312810"}], "created_at": "2020-04-11T15:48:11.642Z", "conditions": {"refund_before_departure": {"fee_currency": "GBP", "fee_amount": "100.00", "allowed": true}, "change_before_departure": {"fee_currency": "GBP", "fee_amount": "100.00", "allowed": true}}, "cancelled_at": "2020-04-11T15:48:11.642Z", "booking_reference": "RZPNX8", "base_currency": "GBP", "base_amount": "30.20"}}