tests/fixtures/get-orders.json

{
  "data": [
    {
      "available_actions": ["cancel", "update"],
      "base_amount": "30.20",
      "base_currency": "GBP",
      "booking_reference": "RZPNX8",
      "cancelled_at": "2020-04-11T15:48:11.642Z",
      "content": "managed",
      "conditions": {
        "change_before_departure": {
          "allowed": true,
          "penalty_amount": "100.00",
          "penalty_currency": "GBP"
        },
        "refund_before_departure": {
          "allowed": true,
          "penalty_amount": "100.00",
          "penalty_currency": "GBP"
        }
      },
      "created_at": "2020-04-11T15:48:11.642Z",
      "documents": [
        {
          "unique_identifier": "1252106312810"
        }
      ],
      "id": "ord_00009hthhsUZ8W4LxQgkjo",
      "live_mode": false,
      "metadata": {
        "customer_prefs": "window seat",
        "payment_intent_id": "pit_00009htYpSCXrwaB9DnUm2"
      },
      "owner": {
        "iata_code": "BA",
        "id": "aln_00001876aqC8c5umZmrRds",
        "name": "British Airways"
      },
      "passengers": [
        {
          "born_on": "1987-07-24",
          "family_name": "Earhart",
          "gender": "f",
          "given_name": "Amelia",
          "id": "pas_00009hj8USM7Ncg31cBCLL",
          "infant_passenger_id": "pas_00009hj8USM8Ncg32aTGHL",
          "title": "mrs",
          "type": "adult"
        }
      ],
      "payment_status": {
        "awaiting_payment": true,
        "payment_required_by": "2020-01-17T10:42:14Z",
        "price_guarantee_expires_at": "2020-01-17T10:42:14Z"
      },
      "services": [
        {
          "id": "ser_00009UhD4ongolulWd9123",
          "passenger_ids": [
            "pas_00009hj8USM7Ncg31cBCLL"
          ],
          "quantity": 1,
          "segment_ids": [
            "seg_00009hj8USM7Ncg31cB456"
          ],
          "total_amount": "15.00",
          "total_currency": "GBP",
          "type": "baggage"
        }
      ],
      "slices": [
        {
          "changeable": false,
          "conditions": {
            "change_before_departure": {
              "allowed": true,
              "penalty_amount": "100.00",
              "penalty_currency": "GBP"
            }
          },
          "destination": {
            "airports": [
              {
                "city": {
                  "iata_code": "NYC",
                  "iata_country_code": "US",
                  "id": "cit_nyc_us",
                  "name": "New York"
                },
                "city_name": "New York",
                "iata_code": "JFK",
                "iata_country_code": "US",
                "icao_code": "KJFK",
                "id": "arp_jfk_us",
                "latitude": 40.640556,
                "longitude": -73.778519,
                "name": "John F. Kennedy International Airport",
                "time_zone": "America/New_York"
              }
            ],
            "city": {
              "iata_code": "NYC",
              "iata_country_code": "US",
              "id": "cit_nyc_us",
              "name": "New York"
            },
            "city_name": "New York",
            "iata_city_code": "NYC",
            "iata_code": "JFK",
            "iata_country_code": "US",
            "icao_code": "KJFK",
            "id": "arp_jfk_us",
            "latitude": 40.640556,
            "longitude": -73.778519,
            "name": "John F. Kennedy International Airport",
            "time_zone": "America/New_York",
            "type": "airport"
          },
          "destination_type": "airport",
          "duration": "PT02H26M",
          "id": "sli_00009htYpSCXrwaB9Dn123",
          "origin": {
            "airports": [
              {
                "city": {
                  "iata_code": "LON",
                  "iata_country_code": "GB",
                  "id": "cit_lon_gb",
                  "name": "London"
                },
                "city_name": "London",
                "iata_code": "LHR",
                "iata_country_code": "GB",
                "icao_code": "EGLL",
                "id": "arp_lhr_gb",
                "latitude": 64.068865,
                "longitude": -141.951519,
                "name": "Heathrow",
                "time_zone": "Europe/London"
              }
            ],
            "city": {
              "iata_code": "LON",
              "iata_country_code": "GB",
              "id": "cit_lon_gb",
              "name": "London"
            },
            "city_name": "London",
            "iata_city_code": "LON",
            "iata_code": "LHR",
            "iata_country_code": "GB",
            "icao_code": "EGLL",
            "id": "arp_lhr_gb",
            "latitude": 64.068865,
            "longitude": -141.951519,
            "name": "Heathrow",
            "time_zone": "Europe/London",
            "type": "airport"
          },
          "origin_type": "airport",
          "segments": [
            {
              "aircraft": {
                "iata_code": "380",
                "id": "arc_00009UhD4ongolulWd91Ky",
                "name": "Airbus Industries A380"
              },
              "arrival_datetime": "2020-06-13T16:38:02",
              "arrival_terminal": "5",
              "arriving_at": "2020-06-13T16:38:02",
              "departing_at": "2020-06-13T16:38:02",
              "departure_datetime": "2020-06-13T16:38:02",
              "departure_terminal": "B",
              "destination": {
                "city": {
                  "iata_code": "NYC",
                  "iata_country_code": "US",
                  "id": "cit_nyc_us",
                  "name": "New York"
                },
                "city_name": "New York",
                "iata_code": "JFK",
                "iata_country_code": "US",
                "icao_code": "KJFK",
                "id": "arp_jfk_us",
                "latitude": 40.640556,
                "longitude": -73.778519,
                "name": "John F. Kennedy International Airport",
                "time_zone": "America/New_York"
              },
              "destination_terminal": "5",
              "distance": "424.2",
              "duration": "PT02H26M",
              "id": "seg_00009htYpSCXrwaB9Dn456",
              "marketing_carrier": {
                "iata_code": "BA",
                "id": "aln_00001876aqC8c5umZmrRds",
                "name": "British Airways"
              },
              "marketing_carrier_flight_number": "1234",
              "operating_carrier": {
                "iata_code": "BA",
                "id": "aln_00001876aqC8c5umZmrRds",
                "name": "British Airways"
              },
              "operating_carrier_flight_number": "4321",
              "origin": {
                "city": {
                  "iata_code": "LON",
                  "iata_country_code": "GB",
                  "id": "cit_lon_gb",
                  "name": "London"
                },
                "city_name": "London",
                "iata_code": "LHR",
                "iata_country_code": "GB",
                "icao_code": "EGLL",
                "id": "arp_lhr_gb",
                "latitude": 64.068865,
                "longitude": -141.951519,
                "name": "Heathrow",
                "time_zone": "Europe/London"
              },
              "origin_terminal": "B",
              "passengers": [
                {
                  "baggages": [
                    {
                      "quantity": 1,
                      "type": "checked"
                    }
                  ],
                  "cabin_class": "economy",
                  "cabin_class_marketing_name": "Economy Basic",
                  "passenger_id": "passenger_0",
                  "seat": null
                }
              ]
            }
          ]
        }
      ],
      "synced_at": "2020-04-11T15:48:11Z",
      "tax_amount": "30.20",
      "tax_currency": "GBP",
      "total_amount": "90.80",
      "total_currency": "GBP"
    }
  ],
  "meta": {
    "after": "g2wAAAACbQAAABBBZXJvbWlzdC1LaGFya2l2bQAAAB=",
    "limit": 50
  }
}
